 Регистрационная анкета участника летних сборов по информатике.

Фамилия, имя, отчество (полностью)
Ключньков Никита Андреевич

Дата рождения
25.04.1993

Паспортные данные российского паспорта (серия, номер, кем и когда выдан)
9207 026029 Отделением в московском районе отдела УФМС России по республике Татарстан в г.Казани выдан 16.05.2007

Паспортные данные заграничного паспорта
нет

Адрес прописки (с индексом)
г.Казань ул.Восход д.7 кв.49

Адрес проживания (с индексом)
2-я Юго-западная д.11 кв.140

Домашний телефон	
(843) 5413753 

Мобильный телефон	
89178844000

E-Mail	
4815162344@mail.ru

ICQ
нет

Фамилия, имя, отчество родителей (полностью)
отец: Ключников Андрей Николаевич
мать: Политковская Наталия Геннадьевна

Рабочий телефон родителей
(843)2644900 + в тоновом режиме 1218

Телефон для экстренной связи (мобильный телефон одного из родителей)
мать:89172483843
отец:89178844111

Учебное заведение, класс
Лицей им. Лобачевского при КГУ, 10 класс

Тренер(ы) (ФИО полностью)
Михайлин Сергей Иванович

Учител(ь|я) информатики (ФИО полностью)
Михайлин Сергей Иванович

Учител(ь|я) математики (ФИО полностью)
Утяганов Сайяр Идмассович

Сколько занимаетесь олимпиадами по информатике?
примерно 3 года

Участие в олимпиадах, на сборах, в компьютерных школах (место проведения, год, результат)
ВКОШП 2007 (диплом 2 степени)
ВКОШП 2008 (диплом 3 степени)
РОИ 2007-2008 (диплом 3 степени)
ЛКШ 2007
ЛКШ 2008

Ник на TopCoder
FMS

Ваши пожелания по проведению сборов
