#define maxn 100000

#include <stdio.h>
#include <algorithm>

using namespace std;

long long n, i, s;  // Змінні повинні мати тип long long, оскільки сума довжин паличок може перевищувати місткість змінної типу int/long
long long a[maxn];  // Довжини паличок

int main()
{
    freopen("set.dat", "r", stdin);
    freopen("set.sol", "w", stdout);

    /* Зчитування: */
    scanf("%d", &n);
    for (i = 0; i < n; i++)
        scanf("%d", &a[i]);
    /* Кінець зчитування */

    sort(a, a + n); // Сортуємо довжини з допомогою стандартного методу

    s = 0;
    for (i = 0; i < n; i++) // Рахуємо початкове значення суми
        s += a[i];

    i = n;
    while (i > 0 && 2 * a[i - 1] >= s)  // Якщо залишилась ще хоча б одна паличка і подвоєна довжина останньої (найбільшої) з паличок не менша за суму всіх, включно з нею
    {
        s -= a[i - 1];  // Відкидаємо цю паличку і перераховуємо суму
        i--;
    }

    printf("%d\n", i);  // Виводимо, скільки паличок залишилося

    return 0;
}
